In [1]:
import pandas as pd

In [2]:
d = {100: ['1A', '2B'], 200: ['2A', '3B'], 300: ['3A', '3B', '4B'], }
df = pd.DataFrame({'a': ['new', 'old'], 'b': [d, ['99A', '99B']]})
df.style # 在 JupyterLab 上展示完整数据

In [3]:
(
    df.assign(b=df.b.map(lambda x: x if isinstance(x, dict) else {-1: x}))
)

     a                                                  b
0  new  {100: ['1A', '2B'], 200: ['2A', '3B'], 300: ['...
1  old                               {-1: ['99A', '99B']}

In [4]:
(
    df.assign(b=df.b.map(lambda x: x if isinstance(x, dict) else {-1: x}))
    .assign(c=lambda x: [i.values() for i in x.b])
)

,a,b,c
0,new,"{100: ['1A', '2B'], 200: ['2A', '3B'], 300: ['...","([1A, 2B], [2A, 3B], [3A, 3B, 4B])"
1,old,"{-1: ['99A', '99B']}","([99A, 99B])"

In [5]:
(
    df.assign(b=df.b.map(lambda x: x if isinstance(x, dict) else {-1: x}))
    .assign(c=lambda x: [i.values() for i in x.b])
    .explode(['b', 'c'])
)

     a    b             c
0  new  100      [1A, 2B]
0  new  200      [2A, 3B]
0  new  300  [3A, 3B, 4B]
1  old   -1    [99A, 99B]

In [15]:
df1 = df.assign(b=df.b.map(lambda x: x if isinstance(x, dict) else {-1: x}))
df1

     a                                                  b
0  new  {100: ['1A', '2B'], 200: ['2A', '3B'], 300: ['...
1  old                               {-1: ['99A', '99B']}

In [16]:
df2 = df1.assign(c=lambda x: [i.values() for i in x.b])
df2

,a,b,c
0,new,"{100: ['1A', '2B'], 200: ['2A', '3B'], 300: ['...","([1A, 2B], [2A, 3B], [3A, 3B, 4B])"
1,old,"{-1: ['99A', '99B']}","([99A, 99B])"

In [9]:
df3 = df2.explode(['b'])
df3

     a    b                                   c
0  new  100  ([1A, 2B], [2A, 3B], [3A, 3B, 4B])
0  new  200  ([1A, 2B], [2A, 3B], [3A, 3B, 4B])
0  new  300  ([1A, 2B], [2A, 3B], [3A, 3B, 4B])
1  old   -1                        ([99A, 99B])

In [10]:
df4 = df2.explode(['c'])
df4

     a                                                  b             c
0  new  {100: ['1A', '2B'], 200: ['2A', '3B'], 300: ['...      [1A, 2B]
0  new  {100: ['1A', '2B'], 200: ['2A', '3B'], 300: ['...      [2A, 3B]
0  new  {100: ['1A', '2B'], 200: ['2A', '3B'], 300: ['...  [3A, 3B, 4B]
1  old                               {-1: ['99A', '99B']}    [99A, 99B]

In [20]:
df4.c

0        [1A, 2B]
0        [2A, 3B]
0    [3A, 3B, 4B]
1      [99A, 99B]
Name: c, dtype: object

In [17]:
df5 = df2.explode(['b'])
df5

     a    b                                   c
0  new  100  ([1A, 2B], [2A, 3B], [3A, 3B, 4B])
0  new  200  ([1A, 2B], [2A, 3B], [3A, 3B, 4B])
0  new  300  ([1A, 2B], [2A, 3B], [3A, 3B, 4B])
1  old   -1                        ([99A, 99B])

In [18]:
df6 = df5.explode(['c'])
df6

     a    b             c
0  new  100      [1A, 2B]
0  new  100      [2A, 3B]
0  new  100  [3A, 3B, 4B]
0  new  200      [1A, 2B]
0  new  200      [2A, 3B]
0  new  200  [3A, 3B, 4B]
0  new  300      [1A, 2B]
0  new  300      [2A, 3B]
0  new  300  [3A, 3B, 4B]
1  old   -1    [99A, 99B]

In [19]:
df7 = df2.explode(['b','c'])
df7

     a    b             c
0  new  100      [1A, 2B]
0  new  200      [2A, 3B]
0  new  300  [3A, 3B, 4B]
1  old   -1    [99A, 99B]